/*
Задача 10: Напишите программу, которая принимает на вход
трёхзначное число и на выходе показывает вторую цифру этого числа.

456 -> 5
782 -> 8
918 -> 1
*/

Console.Clear();
Console.WriteLine("Задача № 10 определение второго числа");
Console.Write("Введите трехзначное число: ");
int num;
if (! int.TryParse(Console.ReadLine(), out num))
{
  System.Console.WriteLine("Некорректный ввод");
  return;
}

int result = (num / 10) % 10;

if (num / 100 < 1 || num / 100 > 10) //проверкана трехзначное число
  Console.WriteLine("Число не является трехзначным");
else
  Console.WriteLine($"Ответ: {result}");
Console.WriteLine("Для продолжения нажмите любую клавишу..." );
Console.ReadKey();

/*
Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

645 -> 5

78 -> третьей цифры нет

32679 -> 6

Задача 15: Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.

6 -> да
7 -> да
1 -> нет
*/